print("\tПривет! Меня зовут Смирнов Виталий, я студент по направлению Python, обучаюсь в Академии \"Топ\". \nСвое "
      "изучение начал пару месяцев назад. \n\n\tОбучение началось с погружением в HTML и CSS, далее JS. "
      "Первые два раздела дались легко, с \"JavaScript\" \nчастью пришлось повозиться и напрячь работу мозга."
      "\n\n\tНадеюсь с Python особых проблем не возникнет, в любом случае буду стараться."
      "\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tСтудент Смирнов В.")
